tap "fcanas/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "stripe/stripe-cli"
brew "aom"
brew "python@3.10"
brew "autojump"
brew "automake"
brew "bat"
brew "gettext"
brew "glib"
brew "pkg-config"
brew "python@3.9"
brew "cmake"
brew "curl"
brew "exa"
brew "fftw"
brew "fzf"
brew "gdk-pixbuf"
brew "gh"
brew "ghostscript"
brew "git"
brew "gobject-introspection"
brew "harfbuzz"
brew "jasper"
brew "shared-mime-info"
brew "libtool"
brew "imagemagick"
brew "libgsf"
brew "pango"
brew "librsvg"
brew "lua"
brew "mysql"
brew "poppler"
brew "postgresql"
brew "tldr"
brew "tmux"
brew "volta"
brew "yarn"
brew "ydiff"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "jesseduffield/lazygit/lazygit"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "qmk/qmk/qmk"
cask "alfred"
cask "appcleaner"
cask "brave-browser"
cask "chromium"
cask "discord"
cask "firefox"
cask "github"
cask "iterm2"
cask "karabiner-elements"
cask "mysqlworkbench"
cask "notion"
cask "obsidian"
cask "postman"
cask "qmk-toolbox"
cask "raycast"
cask "slack"
cask "spotify"
cask "the-unarchiver"
cask "visual-studio-code"
cask "vlc"
